package practice.test0715;

public class Memo {

	
//	http://www.drawio.com/
	
//	컴퓨터와 주사위 대결을 합니다.
//	주사위 대결을 위해서 주사위를 3개 선택합니다.
//	 <주사위 종류>
//	 1. {1,2,3,4,5,6} (일반주사위)
//	 2. {1,1,1,1,6,6} (모아니면도 주사위)
//	 3. {3,3,3,4,4,4} (안전빵주사위)
//	 4. {2,2,2,5,5,5} (애매한주사위)
//
//	선택한 3개의 주사위를 컴퓨터와 번갈아가면서 던집니다
//	(컴퓨터는 1번주사위만 이용한다!)
//	던져서 나온 주사위 눈금을 총점에 더한다
//	 -> 라운드마다 컴퓨터와 나의 점수 공개
//	총점이 1000점이 나오면 끝난다.
//	누가 적게 던졌는지 확인해서 적게 던진 사람이 우승한다.
//
//	<최소조건>
//	 - 클래스/메소드 개념 이용하기 - 객체생성, 필드 등...
//	 - 상속 or 인터페이스 최소한 1번 이용하기
	
//	<심화>
//	 - (컴퓨터1 컴퓨터2 나) 3인대결
//	 - 컴퓨터도 랜덤으로 주사위 뽑기
//	 - 주사위 종류 추가(8면체/12면체...)


}
